[
  {
    "_id": "60d6dfd866b62508b45ee14b",
    "title": "Why people still love retro technology like iPods and instant-film cameras?",
    "blog": "That beaten up Walkman buried in your basement might be someone's hot new accessory. The retro tech market is alive and kicking.\nIn May, Apple refreshed the iPod touch for the first time in four years. Vinyl record sales clocked in at 400 million on average over the past four years, according to data from data tracker Statista. DVD player sales are trending downward, but they still consistently hit four million units sold every holiday quarter, even as recently as 2018.\nOther gadgets that have stayed the course: camcorders, radios, clock radios, desk phones, and DVRs. Millions of these are still in use in US households in 2017, according to Statista.\n\nWhat drives people to continue purchasing vinyl records, instant film cameras, and iPods, long after new products have made those objects irrelevant?\n\nOlder gadgets have a lot of staying power because they allow people to unplug from the constant ping of smartphones and tablets.\n\"There's a growing segment of people that would like to be disconnected but still have access to the things they want,\" said Ryan Reith, program vice president of mobile devices at International Data Corporation, \"So it fills a void in the market.\"\nMany vintage products attract a strong cult following. For example, IPod lovers anticipate Apple's product refreshes on social media and online forums.\n\nApple (AAPL) also appears to be targeting kids in its iPod marketing, according to Paul Gagnon, executive director of research and analysis at IHS Markit.\n\"The brands are starting to build a young consumer base and then eventually transition them as they grow older to more expensive products the company might also make,\" he noted.\nInstant cameras with film are also popular among teens. Fujifilm, which makes Polaroid-like cameras with film that instantly develops, said its sales are holding steady. In its fiscal year ending in March, it sold over 10 million cameras and smartphone printers worldwide. Fujifilm says it's been able to cross generational boundaries by attracting photographers in the digital age.\n\nNostalgia plays a big part in old tech's popularity, too. It can give people that comforting feeling of their childhoods or remind them of a specific time and place.\nOn social media networks like Tumblr and Pinterest, vintage images rack up thousands of likes and shares. Disposable cameras often trend on Pinterest (PINS).\n\"The pace of companies selling new devices and forcing old technology into obsolescence means that certain devices are associated with certain periods in history,\" said Michael Connor, artistic director of Rhizome, a digital art organization.\nVintage gadgets can help people enjoy technology while allowing people to feel connected to the real world. Smartphones often have the opposite effect.\nThat's why people still buy alarm clocks and calculators, even though a smartphone has all those functions.\n\"The smartphone is a bit of a Swiss Army knife. But it's not necessarily specialized,\" said Gagnon.\nSome people will find it easy to use the phone to replace all those older gadgets, he said. But \"a lot of people out there either don't own a smartphone, or for them using those functions is not easy. For those people, legacy products will always exist.\"\nAnd some people like the artistry of older gadgets. People seek out physical items, but they want \"a filtered, idealized version\" of those things, said Amanda Brennan, Tumblr's \"meme librarian\" and head of content insights and social.\n\n\"Polaroids often look blurry, vinyl sound quality is nowhere near an MP3 or stream — but it makes them feel more vibrant, more real-life,\" she said.\nOlder products carry with them unique experiences. Connor, the artistic director, describes how a pixel looks different on an old cathode-ray-tube monitor when compared with a modern-day display. On a CRT monitor, a pixel has a \"soft low res quality\" that can be artistically appealing, said Connor.\n",
    "admin": "Mir Hussain",
    "imageName": "iPod",
    "imageURL": "https://i.ibb.co/gWHb5GQ/ipod.jpg"
  },
  {
    "_id": "60d6e01966b62508b45ee14c",
    "title": "Forgotten Apple gadget Apple Pippin (Pt. 1)",
    "blog": "In 1995, Apple debuted its game console in Japan, followed by a wider release in the US in 1996. Called Pippin, the game console was the result of a collaboration between Apple and Japanese company Bandai. Apple built the internals, while Bandai handled the exteriors including the casing, controls, and packaging.\n\nBased on Macintosh architecture, Pippin was designed to be a multimedia game console that could also connect to the internet, something that made Pippin a fascinating device. Unfortunately, the console’s high price tag of $599 and poor selection of games made Pippin obsolete soon. Pippin remains the only game console Apple has ever made.\n",
    "admin": "Mir Hussain",
    "imageName": "Apple Pippin",
    "imageURL": "https://i.ibb.co/WkJhhyS/apple-pippin.jpg"
  },
  {
    "_id": "60d728cf66b62508b45ee14d",
    "title": "Forgotten Apple gadget iPod Hi-Fi (Pt. 2)",
    "blog": "A year before Apple debuted the iPhone in 2007, the company introduced the iPod Hi-Fi. Although many companies tried to make iPod-powered speakers before, they didn’t offer home stereo quality. Apple in a way reimagined the home stereo market with the iPod Hi-Fi. The device was huge, a single white box with a 30-pin dock connector to dock your iPod. The iPod Hi-Fi was controlled using Apple’s universal IR remote.\n\nWhile it was a great speaker with excellent audio quality, the iPod Hi-Fi only worked with third-generation iPods or those that came after. Many also found the $349 price hard to swallow. The iPod Hi-Fi was discontinued in 2007 after being on the market for 20 months.\n",
    "admin": "Mir Hussain",
    "imageName": "iPod Hi-Fi",
    "imageURL": "https://i.ibb.co/VTnxsNd/i-Pod-hifi.jpg"
  },
  {
    "_id": "60d7290866b62508b45ee14e",
    "title": "Forgotten Apple gadget Newton MessagePad (Pt. 3)",
    "blog": "The Newton MessagePad was Apple’s bold attempt at creating a personal digital assistant (PDA) way back in 1993. It might not have been a huge success, but it did pave the way for mobile devices. The Newton’s biggest feature was handwriting recognition which allowed users to write on the device’s screen with a stylus and the Newton would translate the handwriting into digital text. It also had an infrared networking capability that lets you beam emails and messages from it wirelessly.\n\nOn paper, Newton seemed to be a perfect device, but the execution was flawed. The handwriting recognition was bad and the data transfer was slow. Apple released seven models in over six years before the Newton line was killed by Jobs upon returning to the company in 1997.\n",
    "admin": "Mir Hussain",
    "imageName": "Newton MessagePad",
    "imageURL": "https://i.ibb.co/JFygJn5/apple-newtonpad.jpg"
  },
  {
    "_id": "60d7293a66b62508b45ee14f",
    "title": "Forgotten Apple gadget Apple QuickTake (Pt. 4)",
    "blog": "At a time when John Sculley became the CEO of Apple, the company ventured into the consumer camera market. The QuickTake 100, released in 1994, was built by Kodak. This was a time when digital cameras were still in the infancy and $700 was a lot of money to pay for Apple’s QuickTake.\n\nThe QuickTake wasn’t a commercial success per se, it did pioneer the digital camera market. It had a binocular-like design and captured images at 640×480 and could snap eight photographs. The QuickTake was essentially a 0.3MP camera. A total of three models were released before Steve Jobs discontinued the QuickTake lineup after taking the charge of Apple in 1997.\n",
    "admin": "Mir Hussain",
    "imageName": "Apple QuickTake",
    "imageURL": "https://i.ibb.co/SyxX5d9/apple-quiqk-take.jpg"
  },
  {
    "_id": "60d729bb66b62508b45ee150",
    "title": "Forgotten Apple gadget 20th Anniversary Mac (Pt. 5)",
    "blog": "If you thought the $5000 Mac Pro is expensive, think again. On March 20, 1997, Apple released the 20th Anniversary Macintosh, or TAM for $7,499. The limited-edition computer showed Apple’s design prowess and the ability to sell a $7,499 all-in-one PC to consumers in the late 1990s. It was designed by a young Jony Ive. The TAM wasn’t another AIO.\n\n\nThe Mac was pitched as a complete home entertainment solution with a 12.1-inch LCD screen, a custom Bose stereo speaker, leather palm rests on the keyboard, a built-in TV / FM tuner and remote, and a CD-ROM drive. The machine was constructed with gold-colored plastic, fabric, and Italian leather. Only 12,000 units of TAMs were made. The device was so exclusive that a person in a tuxedo would come and set up the Mac at customer’s homes. If you are interested in the 20th Anniversary Macintosh, you can still buy used ones on eBay for upwards of $2000.\n",
    "admin": "Mir Hussain",
    "imageName": "20th Anniversary Mac",
    "imageURL": "https://i.ibb.co/g7SGgZd/Apple-20th-anniversary.jpg"
  },
  {
    "_id": "60d738af0798000022d7102c",
    "title": "Forgotten Apple gadget Macintosh TV (Pt. 6)",
    "blog": "Imagine a Macintosh that doubles as a TV. Well, in 1993, Apple did launch such a product that could be used as both a computer and cable-ready television. The Macintosh TV essentially used a 14-inch Sony Trinitron CRT display and the included card-sized remote could be used to control it. The Mac resembled a Macintosh LC 500 series, but it was fitted with a TV tuner that converted into a fully-backed TV set.\n\nA device that combines a Macintosh computer, a cable-ready TV set, and the ability to play CDs through the stereo system was unheard of at that time. One big issue with the Macintosh TV was that it was too expensive. Arguably, the biggest disappointment of the Macintosh TV was that you could not watch TV and use the Mac at the same time. The all-back coloured Macintosh was only released in the US. Apple only manufactured 10,000 units of the Macintosh TV before killing the machine four months after its launch.\n",
    "admin": "Mir Hussain",
    "imageName": "Macintosh TV",
    "imageURL": "https://i.ibb.co/k64mr2V/macintoshdh.jpg"
  },
  {
    "_id": "60d763270798000022d7102d",
    "title": "Forgotten Apple gadget Apple PowerMac G4 Cube (Pt. 7)",
    "blog": "Twenty years ago, Apple introduced the revolutionary PowerMac G4, a computer that came in a tiny eight-inch cube. Rather than sticking to a traditional tower design, Jony Ive thought of creating a computer that was an eight-inch cube suspended in a thick, translucent base. The design was to give the impression that the machine was floating in the air. The G4 Cube was fanless, making it extremely quiet.\n\nThe machine was an experiment of sorts of creating a computer for those who want the goodness of an iMac but don’t need all the power of the G4 Tower. The lack of expandability and low-end specifications miffed many power users. In July 2001, even before the device completed a year, Apple discontinued the G4 Cube. The $1800 might not be the massive success Apple had originally anticipated, the G4 Cube remains the company’s best-looking Mac ever created. The New York Museum of Modern Art has a G4 Cube as part of its collection.\n",
    "admin": "Mir Hussain",
    "imageName": "PowerMac G4 Cube",
    "imageURL": "https://i.ibb.co/XbRB9Hk/apple-4g-cube.jpg"
  },
  {
    "_id": "60d7635c0798000022d7102e",
    "title": "Forgotten Apple gadget iSight camera (Pt. 8)",
    "blog": "The one Apple device no one remembers is the iSight camera. Introduced at WWDC 2003, the iSight was Apple’s external video conferencing camera. The iSight sold for $149, and was the most expensive external web camera of its time in the market. Not many remember this, but the iSight was the first Apple product to be crafted out of aluminum.\n\nThe iSight was designed to be mounted on the Mac’s display or on your desk. It featured a 1/4-inch CCD sensor with a F/2.8 aperture lens and a resolution of 640x480p. One of the best parts of the iSight was a mechanical privacy shutter that could be opened and closed by twisting the ring around the lens. It also came with a dual-element microphone for noise suppression. The iSight was designed to work with the PowerBook G4 Aluminum, iBook G4, and the iMac G4. A year later, Apple included a built-in web camera in the iMac G54. The iSight webcam was officially discontinued in 2008.\n",
    "admin": "Mir Hussain",
    "imageName": "iSight  camera",
    "imageURL": "https://i.ibb.co/Lr6fDfW/apple-isight.jpg"
  },
  {
    "_id": "60d7637e0798000022d7102f",
    "title": "Forgotten Apple gadget eMate 300 (Pt. 9)",
    "blog": "Long before the iBook was released, Jony Ive designed the eMate 300. Targeted primarily at the educational market, the eMate 300 was the first and only Newton-OS device that had a keyboard and a stylus. The eMate was visually appealing, just like any other Jony Ive’s designed product. It had a distinctive design with translucent colored plastic casing, a curvy clamshell body, and carrying handle. It ran on Newton OS and came with handwriting recognition, stylus and up to 28 hours of battery on a full charge.\n\nIncidentally, the eMate 300 was also the first Apple notebook to run on an ARM processor. And yes, it supported a touchscreen display. First introduced in March 1997 for $800, the eMate 300 was discontinued, along with the entire Newton line in 1998. Many regard the eBook 300 as the forward-looking laptop of its time. The eMate 300’s design influence can be seen on many Apple products, including the iMac G3, iBook and Power Mac G3.\n",
    "admin": "Mir Hussain",
    "imageName": "eMate 300",
    "imageURL": "https://i.ibb.co/xXcYyH0/apple-emate.jpg"
  }
]
